cylinder/single/gmsh/1ms/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
    "libfoam.so"
    "libmeshTools.so"
    "libsurfMesh.so"
    "libsampling.so"
    "libdynamicMesh.so"
    "liboversetMesh.so"
    "liblduSolvers.so"
    "libforces.so"
);

//write control


//write control


functions
(
    forces
    {
        type                forces;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             ( wall );
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
    }

 forceCoeffs
    {
        type                forceCoeffs;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             ( wall );
        pName               p;
        UName               U;
        rhoName             rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
        liftDir (0 1 0);
        dragDir ( 1 0 0 );
        pitchAxis ( 0 0 0 );
        magUInf 1;
        lRef 1;
        Aref 1;
    }


    pressureTools1
    {
        type                pressureTools;
        functionObjectLibs ("libutilityFunctionObjects.so");
        region              region0;
        enabled             yes;
        calcTotal           no;
        calcCoeff           yes;
        timeStart           0.5;
        timeEnd             0.5;
        outputControl       outputTime;
        outputInterval      1;
        rhoInf              1;
        pInf                101325;
        UInf                (1 0 0);
            
    }

    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;
        probeLocations
        (
            ( 0.012 0 0 )
            ( 0.05 0 0 )
        );

        fields
        (
            p
        );
    }
);


// ************************************************************************* //
