cylinder/single/gmsh/1ms/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     "p|pFinal"
//     {
//         solver           BiCGStab;
//         preconditioner   DILU;
//         minIter          1;
//         maxIter          1000;
//         tolerance        1e-10;
//         relTol           0;
//     }
    "p|pFinal"
    {
        solver          amgSolver;
        cycle           V-cycle;
        policy          cluster;
        nPreSweeps      1;
        nPostSweeps     2;
        groupSize       4;
        minCoarseEqns   5;
        nMaxLevels      100;
        scale           on;
        smoother        ILUC0;

        minIter         0;
        maxIter         100;
        tolerance       1e-7;
        relTol          0.0;
    }
    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        nSweeps          1;

//         solver           BiCGStab;
//         preconditioner   DILU;

        minIter          1;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0;
    }
}


SIMPLE
{
    pRefCell 0;
    pRefValue 0;

    residualControl
        {
            p 1.0E-5;
            U 1.0E-5;
        }
}

PISO
{
    pRefCell 0;
    pRefValue 0;

    nCorrectors 4;

}


// ************************************************************************* //
